from random import (
    seed, 
    random
)

names = {'이은성': 0, '이상헌': 0, '신나연': 0, '이세리': 0, '김현우': 0, 
'김소연': 0, '이창호': 0, '이병조': 0, '김재현': 0, '박혜진': 0, '장수완': 0}

seed(1)
for key in names.keys():
    names[key] = random()

introduce_yourself = sorted(names.items(), key = (lambda x:x[1]))
print(introduce_yourself)
'''
{
 '박혜진': 0.02834747652200631, 
 '김재현': 0.0938595867742349, 
'이은성': 0.13436424411240122, 
'이세리': 0.2550690257394217, 
'김소연': 0.4494910647887381, 
'김현우': 0.49543508709194095, 
'이창호': 0.651592972722763,
'신나연': 0.763774618976614, 
 '이병조': 0.7887233511355132, 
 '장수완': 0.8357651039198697
'이상헌': 0.8474337369372327, 
 }
'''
